[
  {
    "id": 1,
    "titulo": "Matar a un ruiseñor",
    "titulo_original": "To Kill a Mockingbird",
    "anio": "11 de julio de 1960",
    "autor": "Harper Lee",
    "resumen": "La historia se desarrolla en un pequeño pueblo del sur de Estados Unidos y sigue a Scout Finch, cuya infancia se ve marcada por las tensiones raciales cuando su padre, Atticus Finch, defiende a un hombre negro acusado injustamente de violación. La novela explora temas de justicia, prejuicio y moralidad.",
    "stock": 100,
    "precio": 12.99
  },
  {
    "id": 2,
    "titulo": "El señor de los anillos: La comunidad del anillo",
    "titulo_original": "The Lord of the Rings: The Fellowship of the Ring",
    "anio": "29 de julio de 1954",
    "autor": "J. R. R. Tolkien",
    "resumen": "Frodo Bolsón hereda un anillo mágico que contiene un poder oscuro y destructivo. Junto a un grupo de aliados, conocido como la Comunidad del Anillo, debe emprender un peligroso viaje para destruir el anillo en el Monte del Destino antes de que caiga en manos del malvado Señor Oscuro, Sauron.",
    "stock": 100,
    "precio": 9.99
  },
  {
    "id": 3,
    "titulo": "Crónica de una muerte anunciada",
    "titulo_original": "Crónica de una muerte anunciada",
    "anio": "1981",
    "autor": "Gabriel García Márquez",
    "resumen": "En un pequeño pueblo, se narra la historia del asesinato de Santiago Nasar, un joven acusado de deshonrar a una mujer. A pesar de que todos sabían que iba a ser asesinado, nadie hizo nada por evitarlo. La novela explora temas de honor, destino y la inacción colectiva.",
    "stock": 100,
    "precio": 21.99
  },
  {
    "id": 4,
    "titulo": "Orgullo y prejuicio",
    "titulo_original": "Pride and Prejudice",
    "anio": "28 de enero de 1813",
    "autor": "Jane Austen",
    "resumen": "La novela cuenta la historia de Elizabeth Bennet, una joven inteligente y decidida que enfrenta las expectativas sociales y familiares de la Inglaterra del siglo XIX. Su relación con el reservado y orgulloso Sr. Darcy evoluciona desde el prejuicio mutuo hasta el amor verdadero.",
    "stock": 100,
    "precio": 15.49
  },
  {
    "id": 5,
    "titulo": "Cien años de soledad",
    "titulo_original": "Cien años de soledad",
    "anio": "30 de mayo de 1967",
    "autor": "Gabriel García Márquez",
    "resumen": "La historia sigue a la familia Buendía a lo largo de varias generaciones en el pueblo ficticio de Macondo. Mezcla realismo mágico con temas como el amor, la soledad y el destino, mientras relata la fundación y caída del pueblo.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 6,
    "titulo": "1984",
    "titulo_original": "Nineteen Eighty-Four",
    "anio": "8 de junio de 1949",
    "autor": "George Orwell",
    "resumen": "En un mundo distópico controlado por un gobierno totalitario, Winston Smith lucha por encontrar libertad y verdad en medio de la opresión y la vigilancia constante. La novela es una crítica política que explora temas de censura y manipulación.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 7,
    "titulo": "Matar a un ruiseñor",
    "titulo_original": "To Kill a Mockingbird",
    "anio": "11 de julio de 1960",
    "autor": "Harper Lee",
    "resumen": "La novela cuenta la historia de Scout Finch y su hermano Jem en un pequeño pueblo del sur de Estados Unidos durante la Gran Depresión. Su padre, Atticus Finch, defiende a un hombre negro acusado injustamente de violar a una mujer blanca, explorando temas de racismo e injusticia social.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 8,
    "titulo": "Don Quijote de la Mancha",
    "titulo_original": "El ingenioso hidalgo don Quijote de la Mancha",
    "anio": "16 de enero de 1605",
    "autor": "Miguel de Cervantes",
    "resumen": "Don Quijote, un hidalgo obsesionado con los titulos de caballería, decide convertirse en caballero andante. Acompañado por su fiel escudero, Sancho Panza, vive una serie de aventuras mientras lucha contra molinos de viento y persigue ideales caballerescos en un mundo que ha cambiado.",
    "stock": 100,
    "precio": 12.29
  },
  {
    "id": 9,
    "titulo": "Los juegos del hambre",
    "titulo_original": "The Hunger Games",
    "anio": "14 de septiembre de 2008",
    "autor": "Suzanne Collins",
    "resumen": "En un futuro distópico, Katniss Everdeen se ofrece como voluntaria para participar en los Juegos del Hambre, un evento televisado en el que los tributos luchan a muerte. La novela explora temas de supervivencia, opresión y rebelión contra un gobierno tiránico.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 10,
    "titulo": "El gran Gatsby",
    "titulo_original": "The Great Gatsby",
    "anio": "10 de abril de 1925",
    "autor": "F. Scott Fitzgerald",
    "resumen": "La historia sigue a Jay Gatsby, un millonario misterioso que organiza fastuosas fiestas mientras persigue su amor perdido, Daisy Buchanan. La novela examina el sueño americano, la decadencia moral y la obsesión con la riqueza en los años 20.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 11,
    "titulo": "Frankenstein o el moderno Prometeo",
    "titulo_original": "Frankenstein; or, The Modern Prometheus",
    "anio": "1 de enero de 1818",
    "autor": "Mary Shelley",
    "resumen": "La historia sigue a Víctor Frankenstein, un científico que crea un ser monstruoso a partir de partes humanas. La criatura busca aceptación y venganza, explorando temas como la ética científica, el abandono y la responsabilidad moral.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 12,
    "titulo": "Las aventuras de Alicia en el país de las maravillas",
    "titulo_original": "Alice's Adventures in Wonderland",
    "anio": "26 de noviembre de 1865",
    "autor": "Lewis Carroll",
    "resumen": "Alicia cae en la madriguera de un conejo y entra en un mundo mágico lleno de criaturas extrañas y situaciones surrealistas. La novela explora la imaginación, la lógica y el absurdo en un cuento fantástico para todas las edades.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 13,
    "titulo": "La sombra del viento",
    "titulo_original": "La sombra del viento",
    "anio": "2001",
    "autor": "Carlos Ruiz Zafón",
    "resumen": "En la Barcelona de posguerra, un joven llamado Daniel Sempere descubre un misterioso titulo en el Cementerio de los titulos Olvidados. Su búsqueda para descubrir el destino del autor lo lleva a un laberinto de secretos, amores perdidos y tragedias.",
    "stock": 100,
    "precio": 11.99
  },
  {
    "id": 14,
    "titulo": "La ladrona de titulos",
    "titulo_original": "The Book Thief",
    "anio": "2005",
    "autor": "Markus Zusak",
    "resumen": "Ambientada en la Alemania nazi, la historia sigue a Liesel Meminger, una niña adoptada que encuentra consuelo robando titulos y compartiéndolos con otros. La novela está narrada por la Muerte y explora temas de esperanza en tiempos oscuros.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 15,
    "titulo": "Rebelión en la granja",
    "titulo_original": "Animal Farm",
    "anio": "17 de agosto de 1945",
    "autor": "George Orwell",
    "resumen": "Una sátira política que representa una granja donde los animales derrocan a los humanos en busca de igualdad, solo para descubrir que algunos animales terminan siendo más iguales que otros. La novela critica los regímenes totalitarios.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 16,
    "titulo": "El alquimista",
    "titulo_original": "O Alquimista",
    "anio": "1988",
    "autor": "Paulo Coelho",
    "resumen": "La historia sigue a Santiago, un pastor andaluz que emprende un viaje en busca de un tesoro en Egipto. En el camino, aprende lecciones sobre la vida, el destino y la importancia de seguir los sueños propios.",
    "stock": 100,
    "precio": 12.99
  },
  {
    "id": 17,
    "titulo": "Rayuela",
    "titulo_original": "Rayuela",
    "anio": "1963",
    "autor": "Julio Cortázar",
    "resumen": "Una novela experimental que invita al lector a elegir su propio camino a través de los capítulos. Explora la vida de Horacio Oliveira en París y Buenos Aires, abordando temas de amor, arte y filosofía.",
    "stock": 100,
    "precio": 14.99
  },
  {
    "id": 18,
    "titulo": "Fahrenheit 451",
    "titulo_original": "Fahrenheit 451",
    "anio": "19 de octubre de 1953",
    "autor": "Ray Bradbury",
    "resumen": "En un futuro distópico donde los titulos están prohibidos, Guy Montag trabaja como bombero encargado de quemarlos. Su vida cambia cuando comienza a cuestionar el sistema y a buscar conocimiento en los titulos prohibidos.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 19,
    "titulo": "El retrato de Dorian Gray",
    "titulo_original": "The Picture of Dorian Gray",
    "anio": "1890",
    "autor": "Oscar Wilde",
    "resumen": "La historia sigue a Dorian Gray, un joven cuya belleza se mantiene intacta mientras un retrato suyo envejece y refleja los efectos de sus actos inmorales. La novela explora temas como la vanidad, el hedonismo y la corrupción.",
    "stock": 100,
    "precio": 9.99
  },
  {
    "id": 20,
    "titulo": "Drácula",
    "titulo_original": "Dracula",
    "anio": "26 de mayo de 1897",
    "autor": "Bram Stoker",
    "resumen": "La historia de Jonathan Harker, quien viaja a Transilvania para encontrarse con el misterioso Conde Drácula. Pronto descubre los oscuros secretos del conde y se embarca en una lucha contra el mal vampírico.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 21,
    "titulo": "Harry Potter y la piedra filosofal",
    "titulo_original": "Harry Potter and the Sorcerer's Stone",
    "anio": "26 de junio de 1997",
    "autor": "J. K. Rowling",
    "resumen": "El día de su cumpleaños, Harry Potter descubre que es hijo de dos conocidos hechiceros, de los que ha heredado poderes mágicos. Debe asistir a una famosa escuela de magia y hechicería, donde entabla una amistad con dos jóvenes que se convertirán en sus compañeros de aventura. Durante su primer año en Hogwarts, descubre que un malévolo y poderoso mago llamado Voldemort está en busca de una piedra filosofal que alarga la vida de quien la posee.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 22,
    "titulo": "Harry Potter y la cámara secreta",
    "titulo_original": "Harry Potter and the chamber of secrets",
    "anio": "2 de julio de 1998",
    "autor": "J. K. Rowling",
    "resumen": "Harry Potter y los estudiantes de segundo año investigan una malévola amenaza para sus compañeros de clases de Hogwarts, una amenazante bestia que se esconde dentro del castillo.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 23,
    "titulo": "Harry Potter y el prisionero de Azkaban",
    "titulo_original": "Harry Potter and the Prisoner of Azkaban",
    "anio": "8 de julio de 1999",
    "autor": "J. K. Rowling",
    "resumen": "El tercer año de estudios de Harry en Hogwarts se ve amenazado por la fuga de Sirius Black de la prisión de Azkaban. Al parecer, se trata de un peligroso mago que fue cómplice de Lord Voldemort y que intentará vengarse de Harry Potter.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 24,
    "titulo": "Harry Potter y el cáliz de fuego",
    "titulo_original": "Harry Potter and the Goblet of Fire",
    "anio": "8 de julio de 2000",
    "autor": "J. K. Rowling",
    "resumen": "Hogwarts se prepara para el Torneo de los Tres Magos, en el que competirán tres escuelas de hechicería. Para sorpresa de todos, Harry Potter es elegido para participar en la competencia, en la que deberá luchar contra dragones, internarse en el agua y enfrentarse a sus mayores miedos.",
    "stock": 100,
    "precio": 12.59
  },
  {
    "id": 25,
    "titulo": "Harry Potter y la orden del Fénix",
    "titulo_original": "Harry Potter and the Order of the Phoenix",
    "anio": "21 de junio de 2003",
    "autor": "J. K. Rowling",
    "resumen": "En su quinto año en Hogwarts, Harry descubre que muchos integrantes de la comunidad de magos no conocen la verdad acerca de su encuentro con Lord Voldemort. Cornelius Fudge, ministro de magia, designa a Dolores Umbridge como maestra de defensa contra de las artes oscuras porque cree que el profesor Dumbledore planea apoderarse de su trabajo. Pero sus enseñanzas son inadecuadas, por lo que Harry prepara a los estudiantes para defender la escuela en contra del mal.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 26,
    "titulo": "Harry Potter y el misterio del príncipe",
    "titulo_original": "Harry Potter and the Half-Blood Prince",
    "anio": "16 de julio de 2005",
    "autor": "J. K. Rowling",
    "resumen": "Harry descubre un poderoso titulo y, mientras trata de descubrir sus orígenes, colabora con Dumbledore en la búsqueda de una serie de objetos mágicos que ayudarán en la destrucción de Lord Voldemort.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 27,
    "titulo": "Harry Potter y las reliquias de la muerte",
    "titulo_original": "Harry Potter and the Deathly Hallows",
    "anio": "21 de julio de 2007",
    "autor": "J. K. Rowling",
    "resumen": "Harry, Ron y Hermione se van a una peligrosa misión para localizar y destruir el secreto de la inmortalidad y destrucción de Voldemort - los Horrocruces. Solos, sin la guía de sus profesores o la protección del Profesor Dumbledore, los tres amigos deben apoyarse el uno en el otro más que nunca. Pero hay Fuerzas Oscuras en medio que amenazan con separarlos. Harry Potter se está acercando cada vez más a la tarea para la que se ha preparado desde el primer día que pisó Hogwarts: la última batalla con Voldemort.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 28,
    "titulo": "Harry Potter y el legado maldito",
    "titulo_original": "Harry Potter and the Cursed Child",
    "anio": "30 de julio de 2016",
    "autor": "J. K. Rowling",
    "resumen": "El segundo hijo de Harry entró a Hogwarts, pero en Slytherin. Su relación con Harry cada vez es peor y se hizo muy amigo del hijo de Draco, Scorpius Malfoy que se dice que es el hijo de Lord Voldemort",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 29,
    "titulo": "Cien años de soledad",
    "titulo_original": "Cien años de soledad",
    "anio": "30 de mayo de 1967",
    "autor": "Gabriel García Márquez",
    "resumen": "La historia de la familia Buendía en el mítico pueblo de Macondo, donde se entrelazan el amor, la tragedia y la soledad a lo largo de varias generaciones. La novela es un referente del realismo mágico.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 30,
    "titulo": "Crimen y castigo",
    "titulo_original": "Преступление и наказание (Prestupléniye i nakazániye)",
    "anio": "1866",
    "autor": "Fiódor Dostoyevski",
    "resumen": "La novela sigue a Raskólnikov, un estudiante empobrecido que comete un asesinato y luego lidia con la culpa y el remordimiento, explorando temas como la moral, el arrepentimiento y la redención.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 32,
    "titulo": "El señor de los anillos: La comunidad del anillo",
    "titulo_original": "The Lord of the Rings: The Fellowship of the Ring",
    "anio": "29 de julio de 1954",
    "autor": "J. R. R. Tolkien",
    "resumen": "Frodo Bolsón hereda un anillo mágico que debe destruir para evitar que caiga en manos del Señor Oscuro, Sauron. La novela es una épica aventura de fantasía que explora la amistad, el sacrificio y el poder.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 33,
    "titulo": "La isla del tesoro",
    "titulo_original": "Treasure Island",
    "anio": "14 de noviembre de 1883",
    "autor": "Robert Louis Stevenson",
    "resumen": "Jim Hawkins encuentra un mapa del tesoro y se embarca en una peligrosa aventura en busca de riquezas, enfrentándose a piratas como el infame Long John Silver. Es un clásico de la literatura de aventuras.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 34,
    "titulo": "La casa de los espíritus",
    "titulo_original": "La casa de los espíritus",
    "anio": "1982",
    "autor": "Isabel Allende",
    "resumen": "La novela narra la vida de la familia Trueba a lo largo de varias generaciones en un país latinoamericano. Mezcla realismo mágico con política y romance para explorar el amor, la memoria y la dictadura.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 35,
    "titulo": "Los pilares de la Tierra",
    "titulo_original": "The Pillars of the Earth",
    "anio": "1989",
    "autor": "Ken Follett",
    "resumen": "Ambientada en la Inglaterra del siglo XII, la novela sigue la construcción de una catedral mientras explora las luchas políticas, religiosas y personales de los personajes involucrados en el proyecto.",
    "stock": 100,
    "precio": 10.99
  },
  {
    "id": 36,
    "titulo": "El nombre de la rosa",
    "titulo_original": "Il nome della rosa",
    "anio": "1980",
    "autor": "Umberto Eco",
    "resumen": "En una abadía medieval, el monje franciscano Guillermo de Baskerville investiga una serie de misteriosos asesinatos mientras reflexiona sobre la religión, la filosofía y el poder del conocimiento.",
    "stock": 100,
    "precio": 4.99
  },
  {
    "id": 38,
    "titulo": "El principito",
    "titulo_original": "Le Petit Prince",
    "anio": "6 de abril de 1943",
    "autor": "Antoine de Saint-Exupéry",
    "resumen": "Un piloto perdido en el desierto conoce a un pequeño príncipe de otro planeta. La historia es una reflexión sobre el amor, la amistad y la importancia de ver con el corazón en lugar de con los ojos.",
    "stock": 100,
    "precio": 2.99
  }
]